tests_integration_src_test_java_org_mule_test_integration_transport_cxf_CxfOverJMSTestCase.java/[CN]/CxfOverJMSTestCase/[MT]/testCxf()/body

{
  MuleClient client=new MuleClient();
  String req="<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">" + "<soap:Body>" + "<ns2:echo xmlns:ns2=\"http://simple.component.mule.org/\">"+ "<ns2:echo>hello</ns2:echo>"+ "</ns2:echo>"+ "</soap:Body>"+ "</soap:Envelope>";
  client.dispatch("jms://TestComponent",new DefaultMuleMessage(req,muleContext));
  MuleMessage message=client.request("jms://testout",10000);
  assertNotNull(message.getPayload());
  assertTrue(message.getPayloadAsString().indexOf("return>hello") != -1);
}
